Revit 2027 API
FabricationNetworkChangeService.SetPartTypeMappingState Method
 Set the state to enable or disable part type mappings when changing the service. Set to true so the mappings are applied otherwise false.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPartTypeMappingState(
	bool state
)
Public Sub SetPartTypeMappingState (
	state As Boolean
)
public:
void SetPartTypeMappingState(
	bool state
)
member SetPartTypeMappingState :
        state : bool -> unit
Parameters
state Boolean
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace